app/controllers/brides_controller.rb

  def index
    @brides = Bride.all
---
SELECT * FROM `brides`

  def show
    @bride = Bride.find(params[:id])
---
SELECT * FROM `brides` WHERE (`brides`.`id` = 1)

  def create
    @bride = Bride.new(params[:bride])
    if @bride.save
---
INSERT INTO `brides` (`name`, `created_at`, `updated_at`, `wedding_day`) VALUES('Jane', '2010-08-25 17:24:08', '2010-08-25 17:24:08', '2010-08-25 17:24:00')

  def edit
    @bride = Bride.find(params[:id])
---
SELECT * FROM `brides` WHERE (`brides`.`id` = 1)

  def update
    @bride = Bride.find(params[:id])
    if @bride.update_attributes(params[:bride])
---
SELECT * FROM `brides` WHERE (`brides`.`id` = 1)
UPDATE `brides` SET `updated_at` = '2010-08-26 22:10:41', `wedding_day` = '2012-08-26' WHERE `id` = 1

  def destroy
    @bride = Bride.find(params[:id])
    @bride.destroy
---
SELECT * FROM `brides` WHERE (`brides`.`id` = 2)
DELETE FROM `brides` WHERE `id` = 2