app/controllers/donations_controller.rb

SELECT * FROM `donations`
---
  def create
    @donation = Donation.new(params[:donation])
#    @donation.amount = params[:amount]
 #   @donation.paypal_donation = params[:paypal_donation]
    @donation.ip_address = request.remote_ip
    @donation.save
    if !@donation.express_token.blank?