app/controllers/donations_controller.rb

SELECT * FROM `donations`
---
  def index
    @donations = Donation.all

SELECT * FROM `donations` WHERE (`donations`.`id` = 1)
---
  def show
    @donation = Donation.find(params[:id])

SELECT * FROM `donations` WHERE (`donations`.`id` = 4)
---
  def create_express
    @donation = Donation.new(params[:donation])
    @donation.ip_address = request.remote_ip
    response = EXPRESS_GATEWAY.setup_purchase(0,
    :ip => request.remote_ip,
    :return_url => donation_url(Donation.find(@donation.id)),
    :cancel_return_url => brides_url)

INSERT INTO `donations` (`gift_id`, `card_expiration`, `created_at`, `card_type`, `express_payer_id`, `express_token`, `updated_at`, `amount`, `last_name`, `ip_address`, `first_name`, `paypal_donation`) VALUES(NULL, NULL, '2010-08-31 22:48:21', NULL, '2FX3NYJ7J7SM6', 'EC-5X695549XT789215S', '2010-08-31 22:48:21', NULL, 'hernandez', '127.0.0.1', 'freddy', NULL)
---
  def create
    @donation = Donation.new(params[:donation])
    @donation.ip_address = request.remote_ip
    (params[:commit] == "paypal_express")? @donation.paypal_donation = true : @donation.paypal_donation = false

    @donation.user = current_user
    if @donation.save

SELECT * FROM `donations` WHERE (`donations`.`id` = 36)
UPDATE `donations` SET `updated_at` = '2010-09-08 22:52:27', `express_token` = 'EC-51X40708S8840912W', `express_payer_id` = 'WR7XWRYN233AL' WHERE `id` = 41
---
  def paypal_response
    @donation = Donation.find(params[:id])
    @donation.express_token = params[:token]
    @donation.express_payer_id = params[:PayerID]
    @donation.save

SELECT * FROM `donations` WHERE (`donations`.`id` = 1)
DELETE FROM `donations` WHERE `id` = 1
---
  def destroy
    @donation = Donation.find(params[:id])
    @donation.destroy