app/controllers/gifts_controller.rb

  def index
    @gifts = Gift.all
---
SELECT * FROM `gifts`

  def show
    @gift = Gift.find(params[:id])
---
SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)

  def create
    @gift = Gift.new(params[:gift])
    if @gift.save
---
INSERT INTO `gifts` (`name`, `price`, `created_at`, `updated_at`, `total_donations`) VALUES('iPhone', 400.0, '2010-08-25 17:24:56', '2010-08-25 17:24:56', 0.0)